import React from 'react';
import PageContainer from '@/pages/layouts/page-container';
import {Link} from '@inertiajs/react';

export default function About() {
  return (
      <PageContainer title={'من نحن'}>
        <div className="mx-auto max-w-prose space-y-6 text-right leading-relaxed text-muted-foreground" dir="rtl">
          <Link href={'/'} className={'text-center block w-full'}>العودة</Link>
          <p>
            هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى
            يولدها التطبيق.
          </p>
          <p>
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسماً ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي الجرافيك على وجه الخصوص،
            حيث غالباً ما يحتاج المصمم لتصاميم مبدئية تعرض على العميل.
          </p>
          <p>
            وهنا يظهر النص كأنه نص حقيقي ومقروء. عند تصفح التصميم أو العرض التقديمي، سيشعر المشاهد بالارتياح لأن التوزيع البصري يعكس بشكل دقيق الشكل النهائي للمشروع دون أن يتشتت بالتركيز على محتوى
            النصوص ذاتها.
          </p>
          <p>
            يسعى التجمع إلى تقديم رؤية متكاملة تهدف إلى تعزيز التواصل والعمل المشترك، والتأكيد على أهمية النهوض بالخدمات والحلول المبتكرة التي تلبي تطلعات الأفراد والمؤسسات على حد سواء، مع الالتزام
            بأعلى معايير الجودة والاحترافية.
          </p>
          <p>
            إن رسالتنا ترتكز على بناء بيئة داعمة ومستدامة تسهم في تحقيق الأهداف الاستراتيجية، وتفتح آفاقاً جديدة للتعاون المثمر والمستمر بين جميع الأطراف المعنية.
          </p>
        </div>
      </PageContainer>
  );
}